app/controllers/users_controller.rb

  def create
  	@user = User.new(user_params)
  	   if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "cover") VALUES (?, ?, ?, ?, ?, ?)

  def edit
    @user = User.find_by(params[:id])
---
SELECT  "users".* FROM "users" WHERE (11) LIMIT ?  [["LIMIT", 1]]

  def update
    @user = User.find_by(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE (1) LIMIT ?  [["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "cover" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$yLcFBrKpamF2JwQ/t.Wm8u8NIBapeyg7VzcjAFRKPdv9lM0S7FKyK"], ["cover", "u_646492736_635585192_fm_27_gp_0.jpg"], ["updated_at", "2017-09-28 08:51:16.593689"], ["id", 1]]